{
    "Experience": "Experiencia",
    "Projects": "Proyectos",
    "Contact": "Contacto",
    "About": "Sobre mí",

    "title": "Hola! soy Lucas Riestra!",
    "subtitle": "Desarrollador full-stack, viviendo en España. Mi carrera en desarrollo web está en constante evolución. Especializándome tanto en Front-end como Back-end, me enfoco en el diseño web, crear interfaces atractivas, desarrollar lógica, funcionalidades eficientes para paginas web y aplicaciones. Recientemente he terminado un master de software development en 'Assembler Institute of Technology', donde he adquirido la experiencia de un desarrollador full-stack en todos los aspectos.",
    
    "my Projects": "Mis Proyectos",
    "descriptionSonus": "Sonus es una avanzada aplicación de reproductor de música basada en web, con un cliente creado utilizando React con TypeScript y un servidor desarrollado con NodeJS, Prisma, y una base de datos construida en MongoDB. Con una encantadora combinación de características, Sonus se presenta como tu compañero musical definitivo, permitiéndote sumergirte en el mundo de la música. ¡Vamos a explorar lo que Sonus tiene para ofrecer!.",
    "descriptionE-commerce": "LaCaie Vintage es una plataforma de comercio electrónico de ropa vintage, donde puedes embarcarte en un viaje a través de décadas de estilo, comprar de manera eficiente y redescubrir clásicos de la moda que nunca pasan de moda. 🎉 Esta plataforma está diseñada con Figma y construida sobre una combinación de tecnologías modernas, incluyendo React, TypeScript, HTML5 y CSS3. Hemos aprovechado las capacidades de estas herramientas para crear una experiencia de compra fluida y agradable.",
    "descriptionMovieHub":"CineXpress te permite guardar tus películas favoritas con detalles como nombre, foto, score personalizado y género. Explora tus películas con esta aplicación construida en Next.js con TypeScript, con el frontend desplegado en Vercel y el backend en Railway. Todo el diseño fue realizado primeramente con Figma. El backend esta desarrollado con Node.js y Prisma, ademas utiliza una base de datos en MongoDB para almacenar la información. Añadido a esto, la aplicacion tiene test unitarios del CRUD, realizados con Jest. ¡Disfruta de la magia del cine con CineXpress!",

    "descriptionCocktailsApp":"¡Bienvenido a Cocktails App! Esta aplicación web, desarrollada con React y TypeScript, te permite explorar y buscar los mejores cócteles tanto por ingredientes como por nombres. Los datos provienen de la API pública https://www.thecocktaildb.com/api.php, asegurando una amplia y actualizada variedad de cócteles para descubrir. El testing de la app esta hecho con jest, para asegurar su funcionamiento. La aplicación destaca inicialmente los cócteles sin alcohol después de cada búsqueda. Además, cuenta con funcionalidades de paginación para una experiencia de usuario más completa. También puedes refinar tus resultados filtrándolos por una categoría específica. ¡Descubre, mezcla y disfruta de Cocktails App!",

    "descriptionGameVote":"¡Game Vote! Desarrollado el frontend con Next.js y TypeScript, permite a los usuarios votar por sus juegos favoritos de siempre. La aplicación integra Auth0 para una autenticación segura, para votar tienes que hacer login y registrarte, así te convertirás en administrador. Los administradores pueden votar, crear, editar y eliminar juegos, además tienen un limite para votar por hasta 5 juegos. La lista de juegos, en la que puedes buscar tu juego favorito en la barra de busqueda, puede ser ordenada por categoría y votos recibidos. Desarrollado el backend con Express.js, MongoDB y Prisma para el schema de relaciones en la base de datos, la aplicación destaca por su usabilidad y experiencia de votación intuitiva. ¡Explora Game Vote, aporta tu voto y descubre los juegos favoritos de la comunidad!",

    "descriptionRuanoChallenge":"Proyecto desarrollado para Ruano Informatica. Potenciado por React, DevExtreme y aprovechando el dominio en gestión de estado de los átomos de Recoil, nuestra creación presenta una representación cinematográfica, donde podemos ver listas de peliculas y series, con sus nombres, imagen, año y descripcion. Con toques estilísticos sutiles pero refinados cortesía de MaterialUI, este proyecto es una prueba tecnica para exhibir habilidades de organizacion, diseño y desarrollo.",

    "contactMe": "Contáctame",
    "aboutMe": "Sobre mí",
    "aboutMeParagraph": "Hablo español nativo e inglés técnico, lo que facilita la comunicación y colaboración en entornos internacionales. Además de mi experiencia técnica, poseo habilidades blandas como una comunicación efectiva, capacidad para liderar equipos y resolver problemas de manera eficiente. En mi tiempo libre, disfruto del fútbol, tanto viéndolo como jugándolo, y también tengo una pasión por los videojuegos. Como desarrollador full stack, me apasiona crear aplicaciones funcionales y con bonito diseño, y estoy en constante búsqueda de nuevas tecnologías para aprender. ¡Estoy emocionado por las oportunidades que el desarrollo web tiene para ofrecer y estoy listo para seguir creciendo y contribuyendo al mundo tecnológico!"

  }